class Coffee {
  final String name;
  final String type;
  final String shortDesc;
  final String desc;
  final String image;
  final int rate;
  final int price;

  Coffee(
      {this.name,
      this.type,
      this.shortDesc,
      this.desc,
      this.image,
      this.rate,
      this.price});
}

List<Coffee> menu = [
  Coffee(
      name: "คาปูชิโน",
      type: 'Hot',
      shortDesc: "กาแฟนม รสชาติและกลิ่นหอมของนมและฟองนม",
      desc:
          "คาปูชิโนมีส่วนส่วนผสมของ Expresso นมร้อนผ่านไอน้ำ (steamed milk) และนมตีเป็นฟองละเอียด เครื่องดื่มประเภทกาแฟซึ่งมีต้นกำเนิดมาจากประเทศอิตาลี ในประเทศอิตาลี ผู้คนมักดื่มคาปูชิโนเป็นอาหารเช้าโดยเฉพาะ ทั้งนี้อาจเป็นเพราะว่าวิถีชีวิตของชาวอิตาลีมักไม่ค่อยรับประทานอาหารเช้าแบบเป็นกิจลักษณะ คาปูชิโนและขนมปังเบาๆ จึงเหมาะเป็นอาหารรองท้องสำหรับยามเช้า และด้วยเหตุนี้ทำให้ไม่ดื่มคาปูชิโนในช่วงอื่นของวัน",
      image: "assets/cappuccino.jpg",
      rate: 5,
      ),
  Coffee(
      name: "คัฟแฟะมัคคียาโต",
      type: "Hot",
      shortDesc: "กาแฟเอสเปรสโซที่ปิดหน้าด้วยนมเพียงเล็กน้อย",
      desc:
          "คัฟแฟะมัคคียาโต(caffè macchiato) แปลแบบตรงตัวได้ว่า กาแฟที่มีรอยด่าง หรือ กาแฟที่ทำสัญลักษณ์ไว้ การเทนมร้อนธรรมดาลงไปในกาแฟ ซึ่งทำให้เกิดรอยด่างหรือรอยเปื้อนในกาแฟ ฟองนมซึ่งผู้ชงกาแฟหยอดลงไปเพื่อให้พนักงานเสิร์ฟเห็นความแตกต่างระหว่างเอสเปรสโซธรรมดากับเอสเปรสโซที่เติมนมลงไปเล็กน้อย",
      image: "assets/Macchiato.jpg",
      rate: 5,
      ),
  Coffee(
      name: "เอสเพรสโซ",
      type: "Hot",
      shortDesc: "กาแฟที่มีรสแก่และเข้มข้น เป็นกาแฟแบบเพียวๆไม่มีการเติมนม",
      desc:
          "เอสเพรสโซ (Espresso) จะมีรสชาติขมปนหวาน ลื่นคอ ละมุนละไมจากรสแท้ของเมล็ดกาแฟที่ดี ถือได้ว่า เป็นรสชาติที่แตกต่างและไม่สามารถหาได้จากกาแฟชนิดอื่น และด้วยคุณสมบัติดังกล่าว เอสเพรสโซ (Espresso) จึงถูกดัดแปลงให้กลายเป็นกาแฟสูตรต่างๆ ที่นิยมกันในปัจจุบัน",
      image: "assets/espreso.jpg",
      rate: 5,
      ),
  Coffee(
      name: "อเมริกาโน",
      type: "Hot",
      shortDesc: "กาแฟสไสตล์อเมริกันโดยเติมน้ำร้อนผสมลงไปในเอสเพรสโซ",
      desc:
          "อเมริกาโนมีความแก่พอ ๆ กับกาแฟธรรมดา แต่มีกลิ่นและรสชาติที่เข้มอันมาจากเอสเพรสโซ อเมริกาโนเหมาะสำหรับผู้ที่ชื่นชอบกาแฟดำ แต่ไม่หนักถึงขั้นเอสเพรสโซ ส่วนใหญ่นิยมดื่มอเมริกาโนโดยไม่ปรุงด้วยนมหรือน้ำตาล เพื่อดื่มด่ำกับรสชาติกาแฟของอเมริกาโนซึ่งแตกต่างจากกาแฟธรรมดา",
      image: "assets/americano.jpg",
      rate: 5,
      ),
];
